In [4]:
import pandas as pd
#!pip install xlrd

Collecting xlrd
  Downloading xlrd-1.2.0-py2.py3-none-any.whl (103 kB)
Installing collected packages: xlrd
Successfully installed xlrd-1.2.0

In [5]:
df = pd.read_excel("titanic-passengers.xlsx")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,343,No,2,"Collander, Mr. Erik Gustaf",male,28.0,0,0,248740,13.0000,NaN,S
1,76,No,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
2,641,No,3,"Jensen, Mr. Hans Peder",male,20.0,0,0,350050,7.8542,NaN,S
3,568,No,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S
4,672,No,1,"Davidson, Mr. Thornton",male,31.0,1,0,F.C. 12750,52.0000,B71,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,10,Yes,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
887,61,No,3,"Sirayanian, Mr. Orsen",male,22.0,0,0,2669,7.2292,NaN,C
888,535,No,3,"Cacic, Miss. Marija",female,30.0,0,0,315084,8.6625,NaN,S
889,102,No,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
890,428,Yes,2,"Phillips, Miss. Kate Florence (""Mrs Kate Louis...",female,19.0,0,0,250655,26.0000,NaN,S

### Przeżywalność w stsunku do płci

In [26]:
v1 = (df.Sex == "male")
v2 = (df.Sex == "female")
v3 = (df.Survived == "Yes")
df2=df[v1 & v3]
#df2
print(f"Mężczyzn przeżyło: {df2.shape[0]}")

Mężczyzn przeżyło: 109

In [27]:
df3=df[v2 & v3]
df3
print(f"Kobiet przeżyło: {df3.shape[0]}")

Kobiet przeżyło: 233

In [42]:
s1 = 109/891*100
s2 = 233/891*100
print(s1, s2)

12.2334455667789 26.15039281705948

In [43]:
df.Age.max()

80.0

In [44]:
df.Age.min()

0.42

In [45]:
df.Age.idxmin()

693

In [71]:
k1=(df.Pclass == 1)
k2=(df.Pclass == 2)
k3=(df.Pclass == 3)
df[k3].max()

PassengerId                            891
Survived                               Yes
Pclass                                   3
Name           van Melkebeke, Mr. Philemon
Sex                                   male
Age                                     74
SibSp                                    8
Parch                                    6
Ticket                          W./C. 6609
Fare                                 69.55
Embarked                                 S
dtype: object

In [60]:
kv1 = df[k1 & v2]
kv2 = df[k2 & v2]
kv3 = df[k3 & v2]
kvs1 = df[k1 & v2 & v3]
kvs2 = df[k2 & v2 & v3]
kvs3 = df[k3 & v2 & v3]
print(f"kobiety (1,2,3): {kv1.shape[0]} / {kvs1.shape[0]}, {kv2.shape[0]} / {kvs2.shape[0]}, {kv3.shape[0]} / {kvs3.shape[0]}")

kobiety (1,2,3): 94 / 91, 76 / 70, 144 / 72

In [61]:
kv1 = df[k1 & v1]
kv2 = df[k2 & v1]
kv3 = df[k3 & v1]
kvs1 = df[k1 & v1 & v3]
kvs2 = df[k2 & v1 & v3]
kvs3 = df[k3 & v1 & v3]
print(f"mężczyźni (1,2,3): {kv1.shape[0]} / {kvs1.shape[0]}, {kv2.shape[0]} / {kvs2.shape[0]}, {kv3.shape[0]} / {kvs3.shape[0]}")

mężczyźni (1,2,3): 122 / 45, 108 / 17, 347 / 47

In [73]:
p1 =(df.Fare < 10)
p2 =(df.Fare >= 10)
p = (df.Fare <= 50)
p3 =(df.Fare > 50)

In [75]:
ps1 = df[p1 & v3]
ps2 = df[p2 & p & v3]
ps3 = df[p3 & v3]
print(ps1.shape[0], ps2.shape[0], ps3.shape[0])

67 166 109